app/frontend/tests/stress-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30
      arrivalRate: 50
      name: "Initial load"
    - duration: 60
      arrivalRate: 100
      name: "High stress"
    - duration: 120
      arrivalRate: 200
      name: "Extreme stress"
    - duration: 60
      arrivalRate: 300
      name: "Breaking point"
    - duration: 30
      arrivalRate: 50
      name: "Recovery"
  processor: "./test-helpers.cjs"
  variables:
    userId:
      - "1"
      - "2"
      - "3"
      - "4"
      - "5"
    productId:
      - "1"
      - "2"
      - "3"
      - "4"
      - "5"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "High Concurrent Users"
    weight: 70
    flow:
      - get:
          url: "/"
          name: "Homepage"
          expect:
            - statusCode: 200
          beforeRequest: "generateTestData"
          afterResponse: "checkPerformanceThreshold"
          
      - think: 1
      
      - get:
          url: "/api/products"
          name: "Products API Load"
          expect:
            - statusCode: 200
          beforeRequest: "simulateUserBehavior"
          afterResponse: "validateResponse"
          
  - name: "API Stress Test"
    weight: 30
    flow:
      - get:
          url: "/api/products/{{ productId }}"
          name: "Product Detail Stress"
          expect:
            - statusCode: 200
          beforeRequest: "generateRandomProductId"
          afterResponse: "logCustomMetric"